Revit 2027 API
BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedWarning Property
 "In order to find a matching part, the fitting has to be connected to a pipe."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartNotFoundDueToNoPipeConnectedWarning { get; }
Public Shared ReadOnly Property PartNotFoundDueToNoPipeConnectedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartNotFoundDueToNoPipeConnectedWarning {
	FailureDefinitionId^ get ();
}
static member PartNotFoundDueToNoPipeConnectedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace